### 1. Pandas

#### 1) 데이터 추가

In [5]:
import numpy as np
import pandas as pd

df = pd.DataFrame(np.array([[1,2,3], [4,5,6], [7,8,9]]))

display(df)

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [6]:
df.loc[3] = [10,11,12]
display(df)

    0   1   2
0   1   2   3
1   4   5   6
2   7   8   9
3  10  11  12

- ignore_index = True vs. ignore_index = False

In [7]:
df = df.append([[10,11,12]], ignore_index = False); display(df)

C:\Users\Conet\AppData\Local\Temp\ipykernel_5572\1415365815.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df = df.append([[10,11,12]], ignore_index = False); display(df)

    0   1   2
0   1   2   3
1   4   5   6
2   7   8   9
3  10  11  12
0  10  11  12

In [8]:
df = df.append([[10,11,12]], ignore_index = True); display(df)

C:\Users\Conet\AppData\Local\Temp\ipykernel_5572\2354115769.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df = df.append([[10,11,12]], ignore_index = True); display(df)

    0   1   2
0   1   2   3
1   4   5   6
2   7   8   9
3  10  11  12
4  10  11  12
5  10  11  12

In [10]:
# 컬럼 추가
df.columns = list("ABC")  # 컬럼명 변경
print(list("ABC"))  # ABC가 각각 떨어져서 출력

['A', 'B', 'C']

In [12]:
df['D'] = list('dddddd'); display(df)

    A   B   C  D
0   1   2   3  d
1   4   5   6  d
2   7   8   9  d
3  10  11  12  d
4  10  11  12  d
5  10  11  12  d

In [29]:
df[4] = [4] * 6; display(df)

    A   B   C  4
0   1   2   3  4
1   4   5   6  4
2   7   8   9  4
3  10  11  12  4
4  10  11  12  4
5  10  11  12  4

In [23]:
df = df.drop(4, axis = 1); display(df)  # 특정 컬럼 삭제

    A   B   C  D
0   1   2   3  d
1   4   5   6  d
2   7   8   9  d
3  10  11  12  d
4  10  11  12  d
5  10  11  12  d

In [28]:
df = df.drop([4,"D"], axis = 1); display(df)

    A   B   C
0   1   2   3
1   4   5   6
2   7   8   9
3  10  11  12
4  10  11  12
5  10  11  12

In [31]:
df = df.drop([4,5], axis = 0); display(df)

    A   B   C  4
0   1   2   3  4
1   4   5   6  4
2   7   8   9  4
3  10  11  12  4

#### 2) 데이터 변경

In [32]:
df.loc[0][0] = 100; display(df)

C:\Users\Conet\AppData\Local\Temp\ipykernel_5572\1757962989.py:1: FutureWarning: Treating integers as positional in Series.__setitem__ with a Float64Index is deprecated. In a future version, `series[an_int] = val` will insert a new key into the Series. Use `series.iloc[an_int] = val` to treat the key as positional.
  df.loc[0][0] = 100; display(df)

     A   B   C  4
0  100   2   3  4
1    4   5   6  4
2    7   8   9  4
3   10  11  12  4

In [33]:
df.loc[0]["B"] = 100; display(df)

     A    B   C  4
0  100  100   3  4
1    4    5   6  4
2    7    8   9  4
3   10   11  12  4

In [34]:
df.iloc[1]["C"] = 100; display(df)

     A    B    C  4
0  100  100    3  4
1    4    5  100  4
2    7    8    9  4
3   10   11   12  4

In [35]:
df.loc[1]["C"] = 200; display(df)

     A    B    C  4
0  100  100    3  4
1    4    5  200  4
2    7    8    9  4
3   10   11   12  4

In [37]:
df["C"] = [3,6]; display(df)  # 컬럼 변경

ValueError: Length of values (2) does not match length of index (4)

In [38]:
df["C"] = [3,6,4,7]; display(df)  # 컬럼 변경

     A    B  C  4
0  100  100  3  4
1    4    5  6  4
2    7    8  4  4
3   10   11  7  4

#### 3) 데이터 정렬

In [41]:
df = pd.DataFrame({"cluster" : [1,2,3,4,5], "org": ['a','b','c','d','e'], "time": [8,6,34,24,64]}); display(df)

   cluster org  time
0        1   a     8
1        2   b     6
2        3   c    34
3        4   d    24
4        5   e    64

In [40]:
df = df.sort_values([""], ascending = False)
df

     A    B  C  4
3   10   11  7  4
1    4    5  6  4
2    7    8  4  4
0  100  100  3  4

In [42]:
df.describe()  # 기초통계량

        cluster       time
count  5.000000   5.000000
mean   3.000000  27.200000
std    1.581139  23.605084
min    1.000000   6.000000
25%    2.000000   8.000000
50%    3.000000  24.000000
75%    4.000000  34.000000
max    5.000000  64.000000

In [43]:
df.head()  # 데이터 head 부분만 보여줌

   cluster org  time
0        1   a     8
1        2   b     6
2        3   c    34
3        4   d    24
4        5   e    64

In [44]:
df[df.time<10]

   cluster org  time
0        1   a     8
1        2   b     6

In [48]:
month_se = pd.Series(['1월', '2월', '3월', '4월'])
income_se = pd.Series([9500, 6200, 6050, 7000])
expenses_se = pd.Series([5040, 2350, 2300, 4800])
df = pd.DataFrame({'월': month_se, '수익': income_se, '지출': expenses_se})

In [50]:
df

    월    수익    지출
0  1월  9500  5040
1  2월  6200  2350
2  3월  6050  2300
3  4월  7000  4800

In [53]:
m_idx = np.argmax(income_se)  # 최댓값의 색인 위치 출력
print('최대 수익이 발생한 월:', month_se[m_idx])

최대 수익이 발생한 월: 1월

In [54]:
df['total'] = df.sum(axis=1)
print(df)

    월    수익    지출  total
0  1월  9500  5040  29080
1  2월  6200  2350  17100
2  3월  6050  2300  16700
3  4월  7000  4800  23600

C:\Users\Conet\AppData\Local\Temp\ipykernel_5572\3165308713.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df['total'] = df.sum(axis=1)

- 행 추가 시 .loc()/.append()

In [ ]:
df

- 인덱스를 지정해서 생성

- 결측값 유무 확인 (boolean 데이터 형태로 반환)

In [ ]:
pd.isnull(object4)  # pd.Series 형태의 데이터 object4의 결측치 유 확인 (True/False)

In [ ]:
# notnull
pd.notnull(object4)  # pd.Series 형태의 데이터 object4의 결측치 무 확인 (True/False)

In [ ]:
frame2 = pd.DataFrame(data, columns = [], index = [])
frame2

In [ ]:
# row 접근 방법
frame2.loc['특정컬럼이름'] 
# frame2.iloc[숫자] 안됨

In [ ]:
# 결측치가 많이 나올 때 적절히 대체하는 방법; 결측치 앞에 있는 데이터로 넣기
# method = 'bfill'; 결측치 뒤에 있는 데이터로 넣기
object4.reindex(range(6), method = 'ffill')

- 결측치 보정: NaN 이런식으로 바꿔주기

In [ ]:
frame2 = frame.reindex(['a', 'b', 'c', 'd', 'e'])
frame2

In [ ]:
states = ['Texas', 'Utah', 'California']
frame.reindex(columns=states)

- 하나의 로우 또는 컬럼 삭제

In [ ]:
obj = pd.Series(np.arange(5.), index = ['a', 'b', 'c', 'd', 'e'])
obj

In [ ]:
new_obj = obj.drop('c')
new_obj

In [ ]:
obj.drop(['d', 'c'])

In [ ]:
import pandas as pd

data.drop(['two', 'four'], axis = 1)  # 컬럼 삭제

In [ ]:
data.drop(['two', 'four'])  # 에러발생; axis=0이 default이므로 axis = 1 설정해주어야 함

In [ ]:
data['b':'c']  # 라벨이름으로 슬라이싱하는 것은 시작점과 끝점을 포함한다는 것이 일반 파이썬에서의 슬라이싱과 다른점이다.

In [ ]:
# 로우 선택 (각각의 데이터형태 확인) 
data[:2]  # 가능
data[2]  # 불가능
data.iloc[1]  # 가능 (데이터형은 series)
data[1:2]  # 가능 (데이터형은 dataframe)

In [ ]:
data.loc['Colorado', ['two', 'three']]

In [ ]:
data.loc[['Colorado', 'Utah']]  # 데이터프레임 형식으로 출력됨

문제 1

In [67]:
df_score = {"반": ["1반", "2반", "3반"]
            , "번호": [1, 2, 3]
            , "국어": [88, 90, 92]
            , "영어": [98, 96, 90]
            , "수학": [87, 80, 83]}
           # columns = ["반", "번호", "국어", "영어", "수학"]}
df_score = pd.DataFrame(df_score)
df_score

    반  번호  국어  영어  수학
0  1반   1  88  98  87
1  2반   2  90  96  80
2  3반   3  92  90  83

- set_index()와 reindex()의 차이

In [68]:
df_score1 = df_score.set_index(["반", "번호"])  # 특정 컬럼의 값을 인덱스로 변경해줌; 복수개로 인덱스를 설정하는 것
df_score1

       국어  영어  수학
반  번호
1반 1   88  98  87
2반 2   90  96  80
3반 3   92  90  83

In [ ]:
df_score1.reindex()  # 기존에 없는것에 특정 컬럼으로 추가

In [63]:
df_score4 = df_score.append([[]], ignore_index = True)
df_score4

    반  번호  국어  영어  수학
0  1반   1  88  98  87
1  2반   2  90  96  80
2  3반   3  92  90  83

In [64]:
df_score['mean'] = df_score[['국어', '영어', '수학']].mean(axis=1)

In [65]:
df_score

    반  번호  국어  영어  수학       mean
0  1반   1  88  98  87  91.000000
1  2반   2  90  96  80  88.666667
2  3반   3  92  90  83  88.333333

In [ ]:
df1 = df_score.set_index(['반', '번호'])

In [ ]:
df1.unstack("반")

In [ ]:
df1.loc['평균', :] = df1.mean()
df1

문제 1

In [69]:
import pandas as pd
import numpy as np

In [70]:
df_score2 = pd.DataFrame({
        '반' : ['A', 'A', 'A', 'A', 'A', 'B', 'B', 'B', 'B', 'B'],
        '번호' : [1, 2, 3, 4, 5, 1, 2, 3, 4, 5],
        '국어' : [90, 80, 90, 70, 100, 80, 90, 100, 70, 80],
        '영어' : [100, 90, 100, 80, 70, 90, 100, 70, 80, 90],
        '수학' : [80, 100, 80, 90, 80, 100, 70, 80, 90, 100]},
        columns = ["반", "번호", "국어", "영어", "수학"]
    )
df_score2

   반  번호   국어   영어   수학
0  A   1   90  100   80
1  A   2   80   90  100
2  A   3   90  100   80
3  A   4   70   80   90
4  A   5  100   70   80
5  B   1   80   90  100
6  B   2   90  100   70
7  B   3  100   70   80
8  B   4   70   80   90
9  B   5   80   90  100

In [75]:
df_score2.head()

   반  번호   국어   영어   수학
0  A   1   90  100   80
1  A   2   80   90  100
2  A   3   90  100   80
3  A   4   70   80   90
4  A   5  100   70   80

In [71]:
df1 = df_score2.set_index(["반", "번호"])
df1

       국어   영어   수학
반 번호
A 1    90  100   80
  2    80   90  100
  3    90  100   80
  4    70   80   90
  5   100   70   80
B 1    80   90  100
  2    90  100   70
  3   100   70   80
  4    70   80   90
  5    80   90  100

In [73]:
df3 = df1.unstack("반")
df3

     국어        영어        수학
반     A    B    A    B    A    B
번호
1    90   80  100   90   80  100
2    80   90   90  100  100   70
3    90  100  100   70   80   80
4    70   70   80   80   90   90
5   100   80   70   90   80  100

In [74]:
df3.loc['평균', :] = df3.mean()
# df3.mean(axis=0) 디폴트
df3

       국어            영어            수학
반       A      B      A      B      A      B
번호
1    90.0   80.0  100.0   90.0   80.0  100.0
2    80.0   90.0   90.0  100.0  100.0   70.0
3    90.0  100.0  100.0   70.0   80.0   80.0
4    70.0   70.0   80.0   80.0   90.0   90.0
5   100.0   80.0   70.0   90.0   80.0  100.0
평균   86.0   84.0   88.0   86.0   86.0   88.0

- loc와 iloc의 차이

1) head()와 tail() 메소드; 첫, 마지막 항목중에서 지정된 갯수 가져올 수 있음
2) [m:n]; 지정된 구간 m, n의 항목을 가져올 수 있음
3) loc[]; 인덱스에서 특정 레이블이 있는 행을 가져올 수 있음
3) iloc[]; 인덱스에서 정수형 인덱스를 사용하여 특정 위치에 있는 행을 가져올 수 있음

In [79]:
df_score2.iloc[4]  # df.loc['Korea']와 동일함

반       A
번호      5
국어    100
영어     70
수학     80
Name: 4, dtype: object

In [81]:
df_score2.iloc[[2,4]]  # di.iloc[2, 4]는 멀티 행을 지칭하는 것을 의미함

   반  번호   국어   영어  수학
2  A   3   90  100  80
4  A   5  100   70  80

In [80]:
df_score2.iloc[2, 4]

80

In [82]:
df_score2.iloc[2:4]

   반  번호  국어   영어  수학
2  A   3  90  100  80
3  A   4  70   80  90

In [84]:
df_score2[2:4]

   반  번호  국어   영어  수학
2  A   3  90  100  80
3  A   4  70   80  90

In [83]:
df_score2.iloc[[2,3]]  # 슬라이스를 뽑아내므로 차원이 달라짐

   반  번호  국어   영어  수학
2  A   3  90  100  80
3  A   4  70   80  90

- 결측치가 있는 데이터 추출

.isna() vs. isnull()

In [85]:
weather = pd.read_csv('https://github.com/dongupak/DataML/blob/main/csv/weather.csv?raw=true', encoding='CP949', index_col= 0)

In [87]:
weather_df = pd.DataFrame(weather)

In [88]:
weather_df

            평균기온  최대풍속  평균풍속
일시
2010-08-01  28.7   8.3   3.4
2010-08-02  25.2   8.7   3.8
2010-08-03  22.1   6.3   2.9
2010-08-04  25.3   6.6   4.2
2010-08-05  27.2   9.1   5.6
...          ...   ...   ...
2020-07-27  22.1   4.2   1.7
2020-07-28  21.9   4.5   1.6
2020-07-29  21.6   3.2   1.0
2020-07-30  22.9   9.7   2.4
2020-07-31  25.7   4.8   2.5

[3653 rows x 3 columns]

In [98]:
weather_df.reset_index()

              일시  평균기온  최대풍속  평균풍속
0     2010-08-01  28.7   8.3   3.4
1     2010-08-02  25.2   8.7   3.8
2     2010-08-03  22.1   6.3   2.9
3     2010-08-04  25.3   6.6   4.2
4     2010-08-05  27.2   9.1   5.6
...          ...   ...   ...   ...
3648  2020-07-27  22.1   4.2   1.7
3649  2020-07-28  21.9   4.5   1.6
3650  2020-07-29  21.6   3.2   1.0
3651  2020-07-30  22.9   9.7   2.4
3652  2020-07-31  25.7   4.8   2.5

[3653 rows x 4 columns]

In [100]:
weather = weather_df.reset_index()

In [90]:
weather_df.describe()

              평균기온         최대풍속         평균풍속
count  3653.000000  3649.000000  3647.000000
mean     12.942102     7.911099     3.936441
std       8.538507     3.029862     1.888473
min      -9.000000     2.000000     0.200000
25%       5.400000     5.700000     2.500000
50%      13.800000     7.600000     3.600000
75%      20.100000     9.700000     5.000000
max      31.300000    26.000000    14.900000

In [91]:
weather_df.count()

평균기온    3653
최대풍속    3649
평균풍속    3647
dtype: int64

In [93]:
missing_data = weather[weather['평균풍속'].isna()]  # 결측값을 탐지하는 함수
missing_data

            평균기온  최대풍속  평균풍속
일시
2012-02-11  -0.7   NaN   NaN
2012-02-12   0.4   NaN   NaN
2012-02-13   4.0   NaN   NaN
2015-03-22  10.1  11.6   NaN
2015-04-01   7.3  12.1   NaN
2019-04-18  15.7  11.7   NaN

In [94]:
weather['평균풍속'].isna().sum()

6

In [95]:
pd.DataFrame.dropna(missing_data, axis=0, how = 'any', inplace = False)  # or Faslse: 원본 데이터에 덮어쓰지 않음

Empty DataFrame
Columns: [평균기온, 최대풍속, 평균풍속]
Index: []

In [96]:
weather.fillna(0, inplace = True)
print(weather.loc['2012-02-11'])

평균기온   -0.7
최대풍속    0.0
평균풍속    0.0
Name: 2012-02-11, dtype: float64

- 평균값 대체 (결측치 존재 시 사용) vs. 중앙값 대체 (이상치 존재 시 사용)

In [125]:
#: 결측값은 평균값/최빈값 취함

#### 5) 시계열 자료 분석을 통합 (t시간의 흐름에 따라 순차적으로 관측한 값들)

In [ ]:
pd.DatetimeIndex(dt_list).index()

In [ ]:
a = # 코드를 작성하기 위한
weather = pd.read_csv(weather_file, encoding = 'cp949')
weather['month'] = pd.DatetimeIndex(weather['일시']).month

monthly = [None for x in range(12)] # 달별로 구분된 12개의 None값
monthly_wind = [0 for x in range(12)]  # 각 달의 평균 풍속을 담을 리스트

for i in range(12):
    monthly[i] = weather[weather[weather['month'] == i + 1]  # 달별로 분리
    monthly_wind[i] = weather[weather[i].mean()['평균기온']  # 개별 데이터 분석
                              
                              
months = np.arange(1,13)  # 1에서 12월의 연속된 수 생성
plt.bar(months, monthly_wind, color = 'green')
plt.xlabel('Month')
plt.ylabel('Temperature')

- 그룹핑과 필터링

In [101]:
weather['month'] = pd.DatetimeIndex(weather['일시']).month
monthly_means = weather.groupby('month').mean()
print(monthly_means)

            평균기온      최대풍속      평균풍속
month
1       1.598387  8.158065  3.757419
2       2.136396  8.138163  3.904947
3       6.250323  8.871935  4.376129
4      11.064667  9.274000  4.591667
5      16.564194  8.548710  4.219355
6      19.616667  6.945667  3.461000
7      23.328387  7.322581  3.877419
8      24.748710  6.853226  3.596129
9      20.323667  6.896333  3.661667
10     15.383871  7.766774  3.961613
11      9.889667  8.013333  3.930667
12      3.753548  8.045484  3.817097

In [102]:
weather['year'] = pd.DatetimeIndex(weather['일시']).year
yearly_means = weather.groupby('year').mean()
print(yearly_means)

           평균기온      최대풍속      평균풍속      month
year
2010  15.238562  8.205229  4.069281  10.000000
2011  12.073425  8.355616  4.251233   6.526027
2012  11.892896  7.730601  3.832240   6.513661
2013  12.795068  7.859726  3.874795   6.526027
2014  12.844110  7.458904  3.816438   6.526027
2015  13.162466  7.694247  3.778630   6.526027
2016  13.243443  7.963934  3.977869   6.513661
2017  13.111233  8.001370  3.934795   6.526027
2018  13.041644  8.158630  4.085479   6.526027
2019  13.767671  7.775342  3.843836   6.526027
2020  12.233333  7.897183  3.786385   4.009390

In [103]:
monthly_means['평균풍속'] >= 4.0

month
1     False
2     False
3      True
4      True
5      True
6     False
7     False
8     False
9     False
10    False
11    False
12    False
Name: 평균풍속, dtype: bool

In [104]:
monthly_means[monthly_means['평균풍속'] >= 4.0]

            평균기온      최대풍속      평균풍속
month
3       6.250323  8.871935  4.376129
4      11.064667  9.274000  4.591667
5      16.564194  8.548710  4.219355

In [105]:
df = pd.DataFrame({'상품' : ['시계', '반지', '반지', '목걸이', '팔찌'], 
                   '재질' : ['금', '은', '백금', '금', '은'], 
                   '가격': [500000, 20000, 350000, 300000, 60000]}) 
df

    상품  재질      가격
0   시계   금  500000
1   반지   은   20000
2   반지  백금  350000
3  목걸이   금  300000
4   팔찌   은   60000

- 데이터 구조를 변경하기 위한 pivot()

In [106]:
new_df = df.pivot(index='상품', columns = '재질', values = '가격')
new_df

재질          금        백금        은
상품
목걸이  300000.0       NaN      NaN
반지        NaN  350000.0  20000.0
시계   500000.0       NaN      NaN
팔찌        NaN       NaN  60000.0

In [107]:
new_df.fillna(value=0)

재질          금        백금        은
상품
목걸이  300000.0       0.0      0.0
반지        0.0  350000.0  20000.0
시계   500000.0       0.0      0.0
팔찌        0.0       0.0  60000.0

- pd.concat 하나 이상의 데이터프레임을 인자로 받음 
- pd.DataFrame.merge 데이터프레임의 메소드로 두 데이터프레임을 각 데이터에 존재하는 고유값을 기준으로 병합할 때 사용

In [ ]:
pd.merge(df, how = 'outer', left_index = True, right_index = True)

In [110]:
dates = pd.date_range('20220801', periods = 6)
# 행에 해당하는 기준인 인덱스를 index라는 인수로 전달
# 열에 해당하는 기준인 컬럼을 columns라는 인수로 전달
# <참고> np.random.randn(m, n): 평균 0, 표준편차 1의 표준정규분포 난수로 이루어진 matrix array(m, n)를 생성
df = pd.DataFrame(np.random.randn(6, 4), index = dates, columns = list('ABCD'))
df

                   A         B         C         D
2022-08-01 -0.562927 -0.188530  1.796602  0.881092
2022-08-02  1.234267 -0.827641  0.088485  0.267433
2022-08-03  0.523081  0.806493  0.352461 -1.053542
2022-08-04  0.096563 -0.396314 -1.522258 -0.028447
2022-08-05  0.408144  0.228356  0.012489 -1.653305
2022-08-06 -0.599403 -0.344173 -0.659501  0.257891

In [111]:
df2 = pd.DataFrame({'A': 1.,
                    'B': pd.Timestamp('20220802'),  # pd.Timestamp() 는 주어진 값을 'yyyy-mm-dd hh:mm:ss' 형태로 반환
                    'C': pd.Series(1, index = list(range(4)), dtype = 'float32'),
                    'D': np.array([3] * 4, dtype = 'int32'),
                    'E': pd.Categorical(['test', 'train', 'test', 'train']),
                    'F': 'foo'})
df2

     A          B    C  D      E    F
0  1.0 2022-08-02  1.0  3   test  foo
1  1.0 2022-08-02  1.0  3  train  foo
2  1.0 2022-08-02  1.0  3   test  foo
3  1.0 2022-08-02  1.0  3  train  foo

In [113]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

In [114]:
df2.columns

Index(['A', 'B', 'C', 'D', 'E', 'F'], dtype='object')

In [118]:
df.values

array([[-0.5629271 , -0.18852978,  1.79660243,  0.88109215],
       [ 1.23426651, -0.82764107,  0.08848475,  0.26743309],
       [ 0.52308082,  0.80649324,  0.35246122, -1.05354167],
       [ 0.09656259, -0.3963145 , -1.52225803, -0.0284475 ],
       [ 0.40814408,  0.22835574,  0.01248903, -1.65330468],
       [-0.59940317, -0.34417335, -0.65950084,  0.25789139]])

In [119]:
df.sort_index(axis=1, ascending = False)  # 알파벳 dcba 순서로 column index가 정렬됨

                   D         C         B         A
2022-08-01  0.881092  1.796602 -0.188530 -0.562927
2022-08-02  0.267433  0.088485 -0.827641  1.234267
2022-08-03 -1.053542  0.352461  0.806493  0.523081
2022-08-04 -0.028447 -1.522258 -0.396314  0.096563
2022-08-05 -1.653305  0.012489  0.228356  0.408144
2022-08-06  0.257891 -0.659501 -0.344173 -0.599403

In [120]:
df.sort_values(by = 'B')

                   A         B         C         D
2022-08-02  1.234267 -0.827641  0.088485  0.267433
2022-08-04  0.096563 -0.396314 -1.522258 -0.028447
2022-08-06 -0.599403 -0.344173 -0.659501  0.257891
2022-08-01 -0.562927 -0.188530  1.796602  0.881092
2022-08-05  0.408144  0.228356  0.012489 -1.653305
2022-08-03  0.523081  0.806493  0.352461 -1.053542

- 슬라이싱

In [121]:
type(df['A'])

pandas.core.series.Series

In [122]:
df[0:3]

                   A         B         C         D
2022-08-01 -0.562927 -0.188530  1.796602  0.881092
2022-08-02  1.234267 -0.827641  0.088485  0.267433
2022-08-03  0.523081  0.806493  0.352461 -1.053542

In [124]:
df['20220802':'20220804']  # 인덱스명에 해당하는 값들 추출

                   A         B         C         D
2022-08-02  1.234267 -0.827641  0.088485  0.267433
2022-08-03  0.523081  0.806493  0.352461 -1.053542
2022-08-04  0.096563 -0.396314 -1.522258 -0.028447

In [126]:
df.loc[dates[0]]

A   -0.562927
B   -0.188530
C    1.796602
D    0.881092
Name: 2022-08-01 00:00:00, dtype: float64

In [127]:
df.loc[:, ['A', 'B']]

                   A         B
2022-08-01 -0.562927 -0.188530
2022-08-02  1.234267 -0.827641
2022-08-03  0.523081  0.806493
2022-08-04  0.096563 -0.396314
2022-08-05  0.408144  0.228356
2022-08-06 -0.599403 -0.344173

In [129]:
df.loc[['A', 'B']]

KeyError: "None of [Index(['A', 'B'], dtype='object')] are in the [index]"

In [128]:
df[['A', 'B']]

                   A         B
2022-08-01 -0.562927 -0.188530
2022-08-02  1.234267 -0.827641
2022-08-03  0.523081  0.806493
2022-08-04  0.096563 -0.396314
2022-08-05  0.408144  0.228356
2022-08-06 -0.599403 -0.344173

In [130]:
df.loc[dates[0], ['A', 'B']]

A   -0.562927
B   -0.188530
Name: 2022-08-01 00:00:00, dtype: float64

> 배열은 아래처럼 접근 가능하나, 데이터프레임은 아래처럼 접근하면 에러 발생

In [131]:
df[dates[0], ['A', 'B']]

InvalidIndexError: (Timestamp('2022-08-01 00:00:00', freq='D'), ['A', 'B'])

> 아래의 두 결과는 모두 같은 값을 출력

In [132]:
print(df.at[dates[0], 'A'])

print(df.loc[dates[0], 'A'])

-0.5629270986521793
-0.5629270986521793

In [133]:
df.iloc[3]  # index 번호 3, 4

A    0.096563
B   -0.396314
C   -1.522258
D   -0.028447
Name: 2022-08-04 00:00:00, dtype: float64

In [134]:
df.iloc[3:5, 0:2]

                   A         B
2022-08-04  0.096563 -0.396314
2022-08-05  0.408144  0.228356

In [135]:
df.loc[3:5]

TypeError: cannot do slice indexing on DatetimeIndex with these indexers [3] of type int

In [136]:
df.iloc[[1,2,4], [0,2]]  #

                   A         C
2022-08-02  1.234267  0.088485
2022-08-03  0.523081  0.352461
2022-08-05  0.408144  0.012489

In [137]:
df.iloc[1:3, :]
# df.iloc[1:3] 과 같은 결과값 출력

                   A         B         C         D
2022-08-02  1.234267 -0.827641  0.088485  0.267433
2022-08-03  0.523081  0.806493  0.352461 -1.053542

In [139]:
df.iloc[:, 1:3]

                   B         C
2022-08-01 -0.188530  1.796602
2022-08-02 -0.827641  0.088485
2022-08-03  0.806493  0.352461
2022-08-04 -0.396314 -1.522258
2022-08-05  0.228356  0.012489
2022-08-06 -0.344173 -0.659501

In [140]:
df[1:3]  # 인덱스가 1, 2인 컬럼이 올라옴

                   A         B         C         D
2022-08-02  1.234267 -0.827641  0.088485  0.267433
2022-08-03  0.523081  0.806493  0.352461 -1.053542

In [138]:
df.iloc[1:3]

                   A         B         C         D
2022-08-02  1.234267 -0.827641  0.088485  0.267433
2022-08-03  0.523081  0.806493  0.352461 -1.053542

df.loc[0:2] (인덱스 0부터 2포함까지) vs. df.iloc[0:2] (인덱스 0부터 1까지)

In [108]:
i = 0
while i < 4:
    print("안녕!!!!!")
    i += i + 1
    print(i)
    if i >= 6:
        break
print("The End")

안녕!!!!!
1
안녕!!!!!
3
안녕!!!!!
7
The End